export const Headlines = [
    ' एनसेल प्रकरण छानबिन गर्न टंकमणि शर्माको संयोजकत्वमा उच्चस्तरीय समिति',
    'पशुपतिनाथ क्षेत्रमा आजदेशि मासु, मदिरा र नसालु पदार्थ निषेध',
    'शैक्षिक सुधारमा पूर्वशिक्षामन्त्रीको जोड',
    'आगलागी अपडेटः घाइते ४ जनालाई सेनाको एयर एम्बुलेन्समा काठमाडौँ पठाइयो',
    'सुन र हुन्डीको अवैध कारोबारी पाण्डे ७ किलो सुन सहित पक्राउ',
    'दुर्गा प्रसाईंको २० लाखसम्म ऋण मिनाहा गर्ने हल्लाले कर्जा दिन बैंकहरु हच्किएः गभर्नर अधिकारी',
    'नक्कली भारतीय आधारकार्ड बनाएर क्यासिनोमा जुवा खेल्दै नेपाली'
]