import { recent1, recent2, recent3, recent4, recent5 } from "../assets/images";

interface News {
src?:string;
title: string;
oneline?:string;
author?: string;
time: string;
readingTime? : string;
}

export const headlines = [
  " एनसेल प्रकरण छानबिन गर्न टंकमणि शर्माको संयोजकत्वमा उच्चस्तरीय समिति",
  "पशुपतिनाथ क्षेत्रमा आजदेशि मासु, मदिरा र नसालु पदार्थ निषेध",
  "शैक्षिक सुधारमा पूर्वशिक्षामन्त्रीको जोड",
  "आगलागी अपडेटः घाइते ४ जनालाई सेनाको एयर एम्बुलेन्समा काठमाडौँ पठाइयो",
  "सुन र हुन्डीको अवैध कारोबारी पाण्डे ७ किलो सुन सहित पक्राउ",
  "दुर्गा प्रसाईंको २० लाखसम्म ऋण मिनाहा गर्ने हल्लाले कर्जा दिन बैंकहरु हच्किएः गभर्नर अधिकारी",
  "नक्कली भारतीय आधारकार्ड बनाएर क्यासिनोमा जुवा खेल्दै नेपाली",
];

export const recentNews = [
  {
    src: recent1,
    title: "काठमाडौंको तापक्रम निरन्तर घट्दो, चिसो अझ बढ्ने",
    oneline: "राष्ट्रपति रामचन्द्र पौडेलसँग श्रीलंकाका विदेशमन्त्री मोहम्मद उवैस मोहम्मद अली साब्रीले शीष्टाचार भेटवार्ता गरेका छन्।",
    author: "नागरिक",
    time: "१७ मिनेट अघि",
    readingTime: "१ मिनेट पाठ"
  },
  {
    src: recent2,
    title: "विदेशबाट फर्केका श्रमिकहरूको पनि सुधारिएन जीवन",
    time: "१८ मिनेट अघि",
    author: "नागरिक",
    oneline: "राष्ट्रपति रामचन्द्र पौडेलसँग श्रीलंकाका विदेशमन्त्री मोहम्मद उवैस मोहम्मद अली साब्रीले शीष्टाचार भेटवार्ता गरेका छन्।",
    readingTime: "१ मिनेट पाठ"

  },
  {
    src: recent3,
    title:
      "एनसेल बिक्रीविरुद्ध प्रदर्शन गर्ने मानवअधिकारकर्मी पक्राउ (तस्बिरहरु)",
    time: "३७ मिनेट अघि",
    author: "नागरिक",
    oneline: "राष्ट्रपति रामचन्द्र पौडेलसँग श्रीलंकाका विदेशमन्त्री मोहम्मद उवैस मोहम्मद अली साब्रीले शीष्टाचार भेटवार्ता गरेका छन्।",
    readingTime: "१ मिनेट पाठ"

  },
  {
    src: recent4,
    title: "शाहरूख खानको फिल्म 'डंकी' आजदेखि प्रदर्शनमा",
    time: "४९ मिनेट अघि",
    author: "नागरिक",
    oneline: "राष्ट्रपति रामचन्द्र पौडेलसँग श्रीलंकाका विदेशमन्त्री मोहम्मद उवैस मोहम्मद अली साब्रीले शीष्टाचार भेटवार्ता गरेका छन्।",
    readingTime: "१ मिनेट पाठ"

  },
  {
    src: recent5,
    title: "प्रधानमन्त्री कप महिला क्रिकेटः एपीएफद्वारा सुदूरपश्चिम पराजित",
    time: "५२ मिनेट अघि",
    author: "नागरिक",
    oneline: "राष्ट्रपति रामचन्द्र पौडेलसँग श्रीलंकाका विदेशमन्त्री मोहम्मद उवैस मोहम्मद अली साब्रीले शीष्टाचार भेटवार्ता गरेका छन्।",
    readingTime: "१ मिनेट पाठ"

  },
];
